//2)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგების სია,სადაც მოთავსებული იქნება 10 სტრინგი,
//2)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგების სია,სადაც მოთავსებული იქნება 10 სტრინგი,

// შენი დავალებაა რომ -->

// ---გაიგო ამ სიის სიგრძე

// ---გამოიტანო მე3 ინდექსიდან მე8 ინდექსამდე ელემენტები

// ---გამოიტანო მე 4 ე ინდექსიდან 3 ელემენტი

// 3)შექმენი ფუნქცია,გადაეცი ორი სია,ერთი სტრინგების ერთ რიცხვების,შენი დავალებაა რომ გააერთიანო ეს ორი სია ერთმანეთში და მასე დააბრუნო





function func(arr){
    

    const len = arr.length 
    
    const sli = arr.slice(3, 9)

    const sc = arr.splice(4, 3)

    return `${len} ${sli} ${sc}`
    

}
console.log(func(["J", "3", "1", "t", "2", "H", "6", "y", "c"]))