// 1)კომენტარის სახით ახსენით თუ რა არის block scope 

// 2)კომენტარის სახით ახსენით თუ რა არის global scope

// 3)კომენტარის სახით ახსენით თუ რა არის local variables და როგორი ცვლადები არიან ისინი

// 4)კომენტარის სახით ახსენით თუ რა არის global variables და როგორი ცვლადები არიან ისინი

// 5)კომენტარის სახით ახსენით თუ რა არის namespace]

// 6)კომენტარის სახით ახსენით თ რა არის scope pollution




//1 ცვლადები რომლებიც შექმნილნი არიან ბლოკის შიგნით
//2 ცვლადები რომლებიც ყველა ნაწილშია ხელმისაწვდომი 