//4)შექმენით 9 ცვლადი let ის გამოყენებით,3 ცვლადში შეინახეთ ...(ნასწავლი 1) ტიპის მონაცემი,3 ცვლადში შეინახეთ  ...(ნასწავლი 2) ტიპის მონაცემი და სამ ცვლადში შეინახეთ ...(ნასწავლი 3) ტიპის მონაცემი.consol.log()ის დახმარებით დააკონსოლოგეთ 9 ვე ცვლადი და გამოიტანეთ კონსოლში 9 ვე ცვლადში შენახული მნიშვნელობა:
// მაგ:
// let name = "goga"
// console.log(name) --> გამოგვიტანს კონსოლში name ცვლადში შენახულ მნიშვნელობას ანუ "goga" - ს

let variable1 = 67
let variable2 = "Hello, world!"
let variable3 = true || false

console.log(variable1, variable2, variable3)