//2)1 დან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი

// 3)1 დან 100 მდე დაბეჭდეთ ყველა კენტი რიცხი

// 4)1 დან 100 მდე დაბეჭდეთ ყველა რიცხვი მაგრამ თთოეულს მიუწერეთ გვერდით ლუწია თუ კენტი მაგ:

// 1 კენტი
// 2 ლუწი
// 3 კენტი
// 4 ლუწი

for(let i=1; i <= 100; i++) {
    if(i % 2 ===0){
        console.log(i)
    }
}

for(let i = 1; i <= 100; i++) {
    if(i % 2 !== 0){
        console.log(i)
    }
}

for(let i = 1; i <= 100; i++){
    if(i %2 ===0) {
        console.log(i + "luwia")
    }else{
        console.log(i + "kentia")
    }
}