//2)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი






let user = Number(prompt("please enter number(1-10): "))


if(user % 2 == 0){
    for(let i = user; i <= 50; i++){
        if(i % 2 == 0){
            console.log(i)
        }
    }
}else if(user % 2 == 1){
    let i = user
    while(user <= 50){
        if(i % 2 == 1){
            console.log(i)
        }
        i++
    }
}