//8)შექმენი ფუქნცია რომელსაც გადაეცემა არგუმენტად სია,სადაც მოთავსებული იქნება განსხვავებული მონაცემთა ტიპის ელემენტები,შენი დავალეაბა რომ --> დაითვალო ამ სიაში სტრინგ ტიპის მონაცემების რაოდენობა და ინტეჯერ ტიპის მონაცემების ჯამი, ანუ სიაში უდნა დათვალო რამდენი სტრინგია,და ინტეჯერის შემთხვევაში უნდა გაიგო სიაში მყოფი ინტეჯერების(ნამბერების) ჯამი


function count(arr){

    let stR = 0
    let inT = 0

    for(let i = 0; i < arr.length; i++){
        if (typeof arr[i] === "string"){
            stR++
        }else if(arr[i] === "number"){
            inT+=arr[i]
        }
    }

}