//8)დაწერე ფუნქცია, რომელიც იღებს სახელების სიას და აბრუნებს ახალ სიას მხოლოდ იმ სახელებისგან შემდგარს, რომლებსაც სიგრძე 5-ზე მეტია და არის ლუწი.შემდეგ შეამოწმეთამ ახალ სიაში მყოფი სახელებიდან თუ რომელიმე იწყება ასო "ა" ზე ასეთი ელემენტები ამოშალეთ სიიდან(ამაში გამოიყენეთ splice ფუნქცია,თუ მიხვდებით როგორ)



function func(arr){
    let arrNew = []
    for(let i = 0; i < arr.lenght; i++){
        if(arr[i].length > 5 && arr[i] % 2 == 0){
            arrNew.push(arr[i])
        }
    }
    for(let n = 0; n < arrNew.length; i++){
        if(arrNew[n][0] == "ა"){
            arrNew.splice(arrNew[n])
        }
    }
}